import argparse

from scr.oc_products import oc_export_products


def main():
    """
    Основна функція для обробки аргументів командного рядка та запуску OpenCart-інструментів.
    """
    # 1. Створення парсера
    parser = argparse.ArgumentParser(
        description="Інструмент для автоматизації оновлення OpenCart."
    )

    # 2. Додавання аргументів

    parser.add_argument(
        "--oc-export",
        action="store_true",
        help="Експортувати товари OpenCart у CSV файл згідно з обраним пресетом."
    )

    # 3. Парсинг аргументів
    args = parser.parse_args()

    # 4. Вибір функції для запуску

    if args.oc_export:
        print("🚀 Запускаю експорт товарів OpenCart...")
        oc_export_products()

    else:
        print("❌ Не вказано жодної дії. Використайте --help для отримання списку команд.\n")
        parser.print_help()


if __name__ == "__main__":
    main()
